* python experiment
#+BEGIN_SRC python :results output :session :tangle yes :tangle /tmp/abc.py
from threading import Thread
import os
import time

def get_last_line(filename):
    os.system('tail -1 {}'.format(filename))
    print 'exiting'

def write_lines(f):
    print 'writing'
    for i in range(10**1):
        f.write('{}\n'.format(i))
    f.flush()
    os.fsync(f.fileno())



filename = '/tmp/abc.txt'
f = open(filename, 'w')
f.write('bini\n')

tw = Thread(target=write_lines, args=(f,), name='tw')
tw.start()
print tw.name
time.sleep(.1)

threads = [Thread(target=get_last_line, args=(filename, ), name='Thread %s' % i) for i in range(10)]


for t in threads:
    print t.name
    t.start()

tw.join()
for t in threads:    
    t.join()
    





f.close()
#os.unlink(filename)
#+END_SRC

#+RESULTS:
#+begin_example

>>> >>> >>> ... ... ... >>> ... ... ... ... ... ... >>> >>> >>> >>> >>> >>> >>> >>> >>> writing
tw
>>> >>> >>> >>> >>> ... ... ... ... Thread 0
bini
exiting
Thread 1
bini
exiting
Thread 2
bini
exiting
Thread 3
bini
exiting
Thread 4
bini
exiting
Thread 5
bini
exiting
Thread 6
bini
exiting
Thread 7
bini
exiting
Thread 8
bini
exiting
Thread 9
>>> ... ... ... bini
exiting
#+end_example

#+BEGIN_SRC sh :results output
2>&1 python /tmp/abc.py
#+END_SRC

#+RESULTS:
#+begin_example
9
9
9
9
9
9
9
9
9
9
tw
writing
Thread 0
Thread 1
Thread 2
Thread 3
exiting
Thread 4
exiting
Thread 5
exiting
Thread 6
exiting
Thread 7
exiting
Thread 8
exiting
Thread 9
exiting
exiting
exiting
exiting
#+end_example

** Subprocess

#+BEGIN_SRC python :results output :tangle yes :tangle /tmp/source_code134.py
from subprocess import Popen, PIPE
import subprocess

p1 = Popen(["seq", "1", "100"], stdout=PIPE)
p2 = Popen(["awk", "{print $NF}"], stdin=p1.stdout, stdout=PIPE)
p1.stdout.close()  # Allow p1 to receive a SIGPIPE if p2 exits.
p3 = Popen(["head", "-5"], stdin = p2.stdout, stdout=PIPE)
p2.stdout.close()
output = p3.communicate()[0]
print output
#+END_SRC 

#+RESULTS:
: 1
: 2
: 3
: 4
: 5
: 

 
* property
#+BEGIN_SRC python :results output :tangle yes :tangle /tmp/src112d.py
class A(object):
    def __init__(self, a, b):
        self._a = a
        self._b = b

    @property
    def a(self):
        print 'in getter', self._a
        if self._a < 0:
            return 0
        else:
            return self._a


    @a.setter
    def a(self, x):
        print 'in setter', x
        if x < -200:
            self._a = abs(x)
        else:
            self._a = x

    def get_b(self):
        print 'in getter', self._b
        if self._b < 0:
            return 0
        else:
            return self._b

    def set_b(self, x):
        print 'in setter', x
        if x < -200:
            self._b = abs(x)
        else:
            self._b = x

    b = property(get_b, set_b)
    print b.getter, get_b, dir(b)
    print b.setter, set_b
    # print help(property)


ao = A(-11, -2)
print dir(ao)

print ao.a
ao.a = -800
print dir(ao)
print ao.a
# print ao._A__b
print ao.a

print '*' * 20

print ao.b
ao.b = -900
print ao.b
#+END_SRC

#+RESULTS:
#+begin_example
<built-in method getter of property object at 0x7f168d0ec578> <function get_b at 0x7f168d0fe0c8> ['__class__', '__delattr__', '__delete__', '__doc__', '__format__', '__get__', '__getattribute__', '__hash__', '__init__', '__new__', '__reduce__', '__reduce_ex__', '__repr__', '__set__', '__setattr__', '__sizeof__', '__str__', '__subclasshook__', 'deleter', 'fdel', 'fget', 'fset', 'getter', 'setter']
<built-in method setter of property object at 0x7f168d0ec578> <function set_b at 0x7f168d0fe140>
['__class__', '__delattr__', '__dict__', '__doc__', '__format__', '__getattribute__', '__hash__', '__init__', '__module__', '__new__', '__reduce__', '__reduce_ex__', '__repr__', '__setattr__', '__sizeof__', '__str__', '__subclasshook__', '__weakref__', '_a', '_b', 'a', 'b', 'get_b', 'set_b']
in getter -11
0
in setter -800
['__class__', '__delattr__', '__dict__', '__doc__', '__format__', '__getattribute__', '__hash__', '__init__', '__module__', '__new__', '__reduce__', '__reduce_ex__', '__repr__', '__setattr__', '__sizeof__', '__str__', '__subclasshook__', '__weakref__', '_a', '_b', 'a', 'b', 'get_b', 'set_b']
in getter 800
800
in getter 800
800
********************
in getter -2
0
in setter -900
in getter 900
900
#+end_example

#+BEGIN_SRC sh :results output
python /tmp/src112d.py
#+END_SRC

#+RESULTS:
: ['__doc__', '__init__', '__module__', '_a', '_b', 'a', 'b', 'get_b', 'set_b']
: in getter -11
: 0
: ['__doc__', '__init__', '__module__', '_a', '_b', 'a', 'b', 'get_b', 'set_b']
: -800
: -800
: in getter -2
: 0
: -2

* Covert function of 2 args to 1 args
#+BEGIN_SRC python :results output
import functools

base2string = '1000'
print int(base2string, base=2)

base2string_to_int = functools.partial(int, base=2)

print base2string_to_int(base2string)

def simple(base2string, base=2):
    return int(base2string, base=2)

print simple(base2string)

print '*' * 10
for i in range(2, 10+1):
    f = functools.partial(int, base=i)
    print f(base2string)


#+END_SRC

#+RESULTS:
#+begin_example
8
8
8
**********
8
27
64
125
216
343
512
729
1000
#+end_example

